rub/app/controllers/cars_controller.rb

  def index
    @car = Car.all
---
SELECT "cars".* FROM "cars"

  def create
    @car = Car.new(car_params)
    if @car.save
---
INSERT INTO "cars" ("placa", "color", "modelo", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["placa", "XTZ867"], ["color", "negro"], ["modelo", "2011"], ["created_at", "2023-03-17 22:18:54.444759"], ["updated_at", "2023-03-17 22:18:54.444759"]]

  def update
    @car = Car.find(params[:id])
    if @car.update(car_params)
---
SELECT "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "cars" SET "color" = ?, "modelo" = ?, "updated_at" = ?, "avatar" = ? WHERE "cars"."id" = ?  [["color", "Naranja"], ["modelo", "2000"], ["updated_at", "2023-03-22 22:31:26.753669"], ["avatar", "supra.jpg"], ["id", 1]]