rub/app/controllers/phones_controller.rb

    def index
        @phone = Phone.all
---
SELECT "phones".* FROM "phones"

    def show
        @phone =Phone.find(params[:id])
---
SELECT "phones".* FROM "phones" WHERE "phones"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def edit
        @phone =Phone.find(params[:id])
---
SELECT "phones".* FROM "phones" WHERE "phones"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

    def create
        @phone = Phone.new(phone_params)
        if @phone.save
---
INSERT INTO "phones" ("marca", "color", "modelo", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["marca", "Samsung"], ["color", "Negro"], ["modelo", "2022"], ["created_at", "2023-03-17 21:16:25.859609"], ["updated_at", "2023-03-17 21:16:25.859609"]]

    def update
        @phone = Phone.find(params[:id])
        if @phone.update(phone_params)
---
SELECT "phones".* FROM "phones" WHERE "phones"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "phones" SET "marca" = ?, "color" = ?, "modelo" = ?, "updated_at" = ?, "avatar" = ? WHERE "phones"."id" = ?  [["marca", "Xiomi"], ["color", "Azul"], ["modelo", "Note 8"], ["updated_at", "2023-03-24 19:16:44.985954"], ["avatar", "XIAOMI-REDMI-NOTE-8-64GB-3.jpg"], ["id", 4]]